#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_project.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_project" "foreign_language_reader" {
        created_at  = "2020-02-24T07:35:44Z"
        description = "Read text in different languages."
        environment = "Production"
        id          = "9c8405b7-e1c3-4397-a4a7-dbfce6a3cec7"
        name        = "foreign-language-reader"
        owner_id    = 1516704
        owner_uuid  = "1e34495ff67d4ea006257883b8e7c8c769bb687f"
        purpose     = "Web Application"
      ~ resources   = [
            "do:dbaas:9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e",
            "do:dbaas:ed6d0b89-2536-4455-a2ea-56b157ed9bc4",
            "do:domain:foreignlanguagereader.com",
            "do:kubernetes:a5be20d1-0248-460b-a1e1-355d6a5a8c64",
          - "do:loadbalancer:98295436-aea8-4082-88a6-d6432bdc5242",
        ]
        updated_at  = "2020-02-29T07:19:30Z"
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.api will be created
  + resource "digitalocean_record" "api" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "68.183.250.180"
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.language will be created
  + resource "digitalocean_record" "language" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "language"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "68.183.250.180"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
